Repository: darthtenebrus/kglife
Catalog: po/*/kglife.po
Languages: de, ru

# NAME OF TRANSLATORS
source: Your names
de: Eugen Sorotschinski
ru: Евгений Сорочинский

# EMAIL OF TRANSLATORS
source: Your emails
de: webmaster@darkguard.net
ru: webmaster@darkguard.net

source: Dialog
ru: Диалог

source: GeneralPage
de: AllgemeineSeite
ru: Общая Страница

source: Borders And Cells
de: Trennstreifen und Zellen
ru: Разделители ячеек и клетки

source: Background Color
de: Rückfarbe
ru: Цвет фона

source: Cell Color
de: Zellenfarbe
ru: Цвет клетки

source: Cells Border Color
de: Zellentrennstreifenfarbe
ru: Цвет разделителя ячеек

source: Selection Edge Border Color
de: Auswahlkantenrandfarbe
ru: Цвет границы выделения

source: Selected Cells Color
de: Zellenfarbe
ru: Цвет отмеченных клеток

source: Field Edges Type
de: Feldränder
ru: Тип границы поля

source: Field is toroidal
de: Das Feld ist toroidisch
ru: Поле тороидально

source: The field is considered to be a toroid. The cell on the edge has its neighbours at the opposite side
de: Das Feld wird als Toroid betrachtet. Die Zelle am Rand hat ihre Nachbarn auf der gegenüberliegenden Seite
ru: Поле представляет из себя тороид. Соседями клеток с краю считаются клетки на противоположной стороне

source: Toroidal
de: Toroidisch
ru: Тороид

source: Neutral Wall
de: Neutralmauer
ru: Нейтральная стена

source: The field is surrounded by a neutral wall. No cells are born there and it is not taken into the account as a neighbour
de: Das Feld ist von einer neutralen Mauer umgeben. Keine Zellen werden darüber hinaus geboren und sie wird nicht als Nachbar berücksichtigt
ru: Поле окружено нейтральной стеной. За ней ничего не рождается, а ее элементы не участвуют в подсчете соседей

source: Field is infinite (EXPERIMENTAL)
de: Das Feld ist unendlich (EXPERIMENTAL)
ru: Поле бесконечно (ЭКСПЕРЕМЕНТАЛЬНЫЙ РЕЖИМ)

source: Field is infinite. Cells beyond the edges simply disappear continuing their live cycle. <b>Warning: this is still experimental</b>
de: Das Feld ist unendlich. Wird die Zellen hinter den Rändern einfach verschwunden, dann sie ihren Lebenszyklus fortsetzen. <b>Achtung: Dies ist noch experimentell</b>
ru: Поле бесконечно. Клетки за его пределами продолжают свой жизненный цикл <b>ЭКСПЕРЕМЕНТАЛЬНЫЙ РЕЖИМ</b>

source: Infinite
de: Unendlich
ru: Бесконечность

source: Timer slider
de: Schieberegler
ru: Ползунок контроля скорости

source: Initial Value
de: Anfangswert
ru: Начальное значение

source: GeneratorPage
de: GeneratorSeite
ru: ГенераторСтраница

source: Generator parameters
de: Generatorparameter
ru: Параметры генератора

source: Percentage Fill
de: Prozentualfüllung
ru: Процент заполнения

source: Init field before generating
de: Feldeinklärung vor der Generierung
ru: Инициализировать поле перед генерацией

source: Generator distribution for X-axis
de: X-Achsegeneratorverteilung
ru: Распределение для генератора по оси X

source: Distribution type
de: Verteilungsart
ru: Вид распределения

source: Binomial trial success probability
de: Binomialversuchserfolgswahrscheinlichkeit
ru: Вероятность успеха испытания

source: Poisson mean value
de: Mittelwert von Poisson
ru: Мат.ожидание Пуассона

source: Generator distribution for Y-axis
de: X-Achsegeneratorverteilung
ru: Распределение для генератора по оси X

source: PatternsPage
de: Musterseite
ru: СтраницаШаблон

source: Pattern Details
de: Mustereinzelheiten
ru: Детали шаблона

source: Description:
de: Überschreibung:
ru: Описание:

source: Author:
de: Autor:
ru: Автор:

source: Author E-Mail:
de: E-Mail von Autor:
ru: Эл-почта автора:

source: Uniform
de: Gleichmäßig
ru: Равномерное

source: Binomial
ru: Биномиальное

source: Poisson
ru: Пуассоновское

source: &Game
de: &Spiel
ru: &Игра

source: Field
de: Feld
ru: Поле

source: Analysis
ru: Анализ

source: Main Toolbar
de: Hauptsymbolleiste
ru: Основная панель инструментов

source: This application (*.kgol);;Object Vector Format (*.ovf);;Life32/XLife Run Length Encoding (*.rle);;Plaintext (*.cells);;All files (*.*)
de: Diese Anwendung (*.kgol);;Object Vector Format (*.ovf);;Life32/XLife RLE (*.rle);;Plaintext (*.cells);;Alle Datei (*.*)
ru: Это приложение (*.kgol);;Формат Object Vector (*.ovf);;Формат Life32/XLife RLE (*.rle);;Plaintext (*.cells);;Все файлы (*.*)

source: Load colony from file
de: Kolonie von der Datei einladen
ru: Загрузить колонию из файла

source: This application (*.kgol);;Life32/XLife Run Length Encoding (*.rle);;Plaintext (*.cells)
de: Diese Anwendung (*.kgol);;Life32/XLife RLE (*.rle);;Plaintext (*.cells)
ru: Это приложение (*.kgol);;Формат Life32/XLife RLE (*.rle);;Plaintext (*.cells)

source: Save colony current state
de: Den Koloniezustand speichern
ru: Сохранить текущее состояние колонии

source: Set or erase a single cell by double click or drag a line with left button pressed
de: Mausdoppelklick um die Einzelle setzen oder löschen
ru: Установите или снимите клетку двойным нажатием или проведите линию, зажав левую кнопку

source: Drag the mouse to move field
de: Linke Maustaste halten um das Feld zu bewegen
ru: Зажмите левую кнопку и передвиньте поле с помощью мыши

source: Put any cells here by mouse click or simply drag a line of cells.<br>You can also zoom in and out with a mouse wheel or action controls
de: Stellen Sie hier mit Mausklick beliebige Zellen ein oder ziehen Sie einfach eine Zelllinie auf
ru: Расположите любое количество клеток щелчком мыши или проведите линию, зажав левую кнопку. Можно изменять масштаб при помощи колеса мыши или элементов управления

source: In move mode you simply drag the mouse to move the field and see the cells beyond the edges
de: Ziehen Sie einfach die Maus, um das Feld zu bewegen und die Zellen über der Ränder zu sehen
ru: В режиме перемещения просто перетащите мышкой поле, чтобы увидеть клетки за его пределами

source: Drag the mouse to select the live cells
de: Linke Maustaste halten um die Lebenzellen zu auswählen
ru: Зажмите левую кнопку и передвиньте мышь чтобы выделить живые клетки

source: In select mode you simply drag the mouse to select the live cells
de: Ziehen Sie einfach die Maus, um die Lebenzellen zuauswählen
ru: В режиме отметки просто проведите курсором мыши с нажатой левой кнопкой, чтобы выделить живые клетки

source: General
de: Allgemeine
ru: Общие

source: Patterns
de: Muster
ru: Шаблоны

source: Generator
ru: Генератор

source: Open file failed
de: Dateiladen Fehler
ru: Не удалось открыть файл

source: Error
de: Fehler
ru: Ошибка

source: Invalid file format
de: Ein Dateiformat ist falsch
ru: Неверный формат файла

source: Print Pattern
de: Muster abdrucken
ru: Печать текущей конфигурации

source: Colony is empty
de: Leerkolonie
ru: Колония пуста

source: Unknown Object
de: Unbekannterobjekt
ru: Неизвестный объект

source: Square
ru: Квадрат

source: Zigzag
ru: Зигзаг

source: Glider
de: Segelflugzeug
ru: Глайдер

source: Vertical Blinker
de: Vertikalerblinker
ru: Мигалка вертикальная

source: Horizontal Blinker
de: Horizontalerblinker
ru: Мигалка горизонтальная

source: Result
de: Ergebnis
ru: Результат

source: Object Vector Format (*.ovf)
ru: Формат Object Vector (*.ovf)

source: Save objects model
de: Objektemodell speichern
ru: Сохранить модель объектов

source: Paste at this position
de: An dieser Stelle bekleisten
ru: Поместить в позицию левого угла меню

source: Empty
de: Erlöschen
ru: Очистить выделенную область

source: Fill
de: Füllen
ru: Заполнить выделение

source: Select untouched
de: Unberührt wählen
ru: Выделить незатронутое

source: Save selected
de: Ausgewählten speichern
ru: Сохранить выделенное

source: Simple Game Of Life realization
de: Die eifache Lebenspielrealisierung
ru: Простая реализация игры "Жизнь"

source: Created by:
de: Erstellt von:
ru: Создано:

source: Usage %1 [options]
de: Benutzen: %1 [Argumente]
ru: Использование %1 [параметры]

source: Valid options:
de: Gültige Argumenten:
ru: Допустимые переметры:

source: show this help
de: Diese Hilfe anzeigen
ru: показать эту инструкцию

source: display version
de: Die Version anzeigen
ru: показать версию

source: Unknown option %1
de: Unbekannte Argument %1
ru: Неизвестный параметр %1

source: Launch %1 -h or %1 --help for help
de: Starten %1 -h oder %1 --help ,um Hilfe zu erhalten
ru: Запустите %1 -h or %1 --help для получения инструкции

source: Launch this application without any parameters to see its main functional
de: Starten die App ohne Argumente, um die Hauptfunktion zu sehen
ru: Запустите без параметров, чтобы увидеть полный функционал

source: Game Of Life
de: Lebenspiel
ru: Игра "Жизнь"

source: Conway's Game Of Life for KDE
de: KDE Lebenspiel von Conway
ru: Игра "Жизнь" Конуэя

source: Construct and experiment with many cell colonies
de: Konstruiren Sie verschiedene Kolonie und machen die Experimente
ru: Конструируйте и эксперементируйте со множеством колоний

source: Original author
de: Hauptautor
ru: Автор кода

source: Start evolution
de: Symbolleiste anzeigen
ru: Начать эволюцию

source: Stop evolution
de: Statusleiste anzeigen
ru: Остановить эволюцию

source: Generation: %1
ru: Поколение %1

source: Open configuration dialog
de: Einrichtungsfenster aufmachen
ru: Показать диалог настроек

source: Load saved colony
de: Die gespeicherte Kolonie einladen
ru: Загрузить сохраненную колонию

source: Save current colony
de: Den Koloniezustand zur Datei speichern
ru: Сохранить колонию

source: Save current colony with different name
de: Den Koloniezustand zur Datei mit dem anderen Namen speichern
ru: Сохранить колонию под другим именем

source: Time step control
de: Geschwindigkeitsregler
ru: Ползунок контроля скорости

source: New &Game
de: Neues &Spiel
ru: &Новая игра

source: Clear the field and stop evolution
de: Aufklaren das Spielfeld und die Evolution halten
ru: Очистить поле и остановить эволюцию

source: Generate &Random
de: &Zufällig erzeugen
ru: Случайная генерация

source: Generates random pattern
de: Zufälliges Muster erzeugen
ru: Генерирует случайную конфигурацию

source: &Next Step
de: &Nächster Schritt
ru: Следующий шаг

source: Next single evolution step
de: Nächster Evolutionsschritt
ru: Следующий шаг эволюции

source: &Start/Stop Game
de: Start/Halt ein Spiel
ru: Начать/Остановить игру

source: Start or stop continuous evolution.<br> The icon changes to match the current mode
de: Kontinuierliche Weiterentwicklung starten oder halten.<br> Das Symbol ändert sich entsprechend dem aktuellen Modus
ru: Начать или остановить эволюцию.<br>Иконка меняется в зависимости от режима

source: &Move
de: &Bewegen
ru: &Перемещение

source: Click here to enter field move mode.<br>In this mode you can move the field to see the cells that don't fit the screen due to current zoom
de: Machen Sie eine Mausclick, um das Feldverschiebungsmodus zu eintragen. Mit diesem Modus können Sie das Feld verschieben, um die Zellen, die den Bildschirm nicht passen wegen des Maßstabs
ru: Нажмите, чтобы перейти в режим перемещения.<br> Перемещайте поле, если не все клетки помещаются на экране из-за масштаба

source: Object chordes sort
ru: Сортировка хорд объектов

source: &Mouse selection
de: &Mausauswahl
ru: &Выделение мышью

source: Click here to enter select mode.<br>In this mode you can select alive cells to cut and copy
de: Machen Sie eine Mausclick, um das Auswahlmodus zu eintragen. Mit diesem Modus können Sie die lebenzellen auswählen, um sie zu kopieren oder löschen
ru: Нажмите, чтобы перейти в режим выделения.<br> В этом режимн можно выделить клетки дял того, чтобы вырезать/скопировать

source: &Clear selection
de: Auswahl löschen
ru: Снять выделение

source: Click here to clear selection
de: Machen Sie hier ein Mausklick, ein Auswahl zu löschen
ru: Нажмите, чтобы снять выделение

source: Zoom scale in. You can also use mouse wheel.<br> Dimmed on maximum zoom
de: Zunehmen den Maßstab. Können Sie auch das Mausrad benutzen <br> Dunkelt when der Maßstab maximum ist
ru: Увеличить масштаб. Можно использовать колесо мыши.<br> Затемнена, если масштаб максимальный

source: Zoom scale out. You can also use mouse wheel.<br> Dimmed on minimal zoom
de: Verringern den Maßstab. Können Sie auch das Mausrad benutzen <br> Dunkelt when der Maßstab minimum ist
ru: Уменьшить масштаб. Можно использовать колесо мыши.<br> Затемнена, если масштаб минимальный

source: Restore initial zoom.<br>Dimmed when the zoom is minimal
de: Wiederherstellen den Maßstab.<br> Dunkelt when der Maßstab minimum ist
ru: Восстановить начальный масштаб.<br>Затемнена, если масштаб минимальный

source: Empty file
de: Leerdatei
ru: Пустой файл

source: File name: %1
de: Dateiname: %1
ru: Имя файла: %1

source: Generation Change Rate
de: Veränderengeschwindigkeit
ru: Скорость смены поколений

source: You can change generation rate even when evolution is in progress
de: Veränderen Sie die Geburstgeschwindigkeit sogar wenn die Evolution progreßiert
ru: Можно изменять скорость смены поколений даже во время эволюции

source: <Not selected>
de: <Keine Auswahl>
ru: <Не выбран>

source: Object chordes coverage
de: Chordedenabdeckung
